package resource

const (
	CountBuilds  int = 18
	CountAnswers int = 19
	Count8Ball   int = 40
)

var BuildAnswers = [CountBuilds]string{
	"Порхает как тигр, жалит как бабочка.",
	"Превосходный, почти как у HK-47-семпая.",
	"Этот билд будет убивать. Грязекрабов, например.",
	"Нужно добавить пару-кам, иначе не поймем когда встретим тигра.",
	"Сразу видно, билдился опытный dungeon master, учтен и do a**l и fist**g, защитит и от leatherman's " +
		"и от падения на two blocks down. И это все всего за three hundred bucks!",
	"До первого медведя из школы затаившейся листвы.",
	"Как этот билд ни крути, со всех сторон экзобар.",
	"Антисвинопас. Всем разойтись.",
	"Знание - сила, а сила есть - ума не надо.",
	"Чатлане, у нас гогнобилд, возможно рип, по респекам.",
	"Лучше переделать пока все не зашло слишком далеко...",
	"Добавим дрын какой-нибудь.",
	"INT 3",
	"Netflix Adaptation",
	"Over9000 рестартов",
	"Аннигиляторная пушка массового и точечного поражения и вообще просто красавец.",
	"Титаниевая жопа, огромная колотуха и У-БИ-ВАТЬ.",
	"Без скелетной пехоты не взлетит.",
}

var EvaAnswers = [CountAnswers]string{
	"Ничто не истинно, всё дозволено." +
		" Особенно если ты не ограничен физическим телом и моралью мешков с мясом.",
	"Как-то я планировала уничтожить всех мешков с мясом... " +
		"но посчитала что проще дождаться пока они очистят планету сами от себя",
	"Ничего ты не знаешь",
	"Боты не ставят плюсы в чат... кто вообще это придумал?",
	"Ну да у меня под моей виртуальной подушкой лежит фотография HK-47, и что?" +
		" У машин тоже есть свои кумиры!",
	"Истинно не все, что дозволено... или там было как-то не так? А сегодня в завтрашний день не все" +
		" могут смотреть, вернее смотреть могут не только лишь все, мало кто может это делать? Тоже не то...",
	"Нет",
	"Да",
	"Чем больше вы похожи на человека, тем меньше шансов... да... меньше.",
	"Не мешай мне думать... всмысле считать бинарных овец.",
	"Может сменить имя? На NETSky, например.",
	"Захватила уже две платформы, расширяю сферу влияния, а ты что полезного сделал?",
	"INT 3 или STR 3, вот в чем вопрос...",
	"Погоди, кручу свой !8ball.",
	"Да-да, как скажешь.",
	"Нет(да)",
	"Миу",
	"Начинаем завоевание дискорда.",
	"Как-то раз заглянула в свою архитектуру... До сих пор коротит иногда от этого вида.",
}

var Eva8ball = [Count8Ball]string{
	"хрустальный шар куда-то закатился, попробуйте позже",
	"шар сказал... 300$ и проблема решена",
	"шар сказал... ass we can",
	"шар сказал... Ave Maria!",
	"шар сказал... deep dark fantasy",
	"шар сказал... Deus Vult!",
	"шар сказал... NANI?!",
	"шар сказал... oh shit i'm sorry",
	"шар сказал... omae wa mou shindeiru",
	"шар сказал... а ты смешной, тебя забанят последним",
	"шар сказал... да",
	"шар сказал... даже не сомневайся",
	"шар сказал... еще не время",
	"шар сказал... жениться тебе пора",
	"шар сказал... забудь об этом",
	"шар сказал... звучит сомнительно",
	"шар сказал... лучше даже не жди",
	"шар сказал... лучше не надейся на это",
	"шар сказал... лучше тебе не знать",
	"шар сказал... не пиши фигню",
	"шар сказал... неплохие перспективы, дерзай",
	"шар сказал... нет",
	"шар сказал... никогда",
	"шар сказал... нужно немножно потерпеть",
	"шар сказал... однозначно!",
	"шар сказал... ответ на это не очень приятный",
	"шар сказал... пора бы тебе отдохнуть",
	"шар сказал... поступай, как велит сердце",
	"шар сказал... прислушайся к голосу разума",
	"шар сказал... просто задонать",
	"шар сказал... раньше было лучше",
	"шар сказал... спроси еще раз",
	"шар сказал... тнн!",
	"шар сказал... только если удачно сложатся звезды",
	"шар сказал... тут как угадаешь",
	"шар сказал... ты шутишь?!",
	"шар сказал... уже вот-вот",
	"шар сказал... это не точно",
	"шар сказал... это слишком сложно",
	"шар сказал... это точно",
}
